# \> Группировка (6/6)
Отберите для пользователей из Москвы экспериментальные группы, в которых средний возраст больше `27.2`. Напишите через пробел число пользователей в этих группах.

In [1]:
import pandas as pd
from db_con import connection

sql_query = """
    select
        city
        , exp_group
        , count(id) as total_users
        , avg(age) as avg_age
    from "user"
    where True
        and city = 'Moscow'
    group by
        city
        , exp_group
    having avg(age) > 27.2
"""
df = pd.read_sql(
    sql_query,
    con=connection
)
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   city         2 non-null      object
 1   exp_group    2 non-null      int64
 2   total_users  2 non-null      int64
 3   avg_age      2 non-null      float64
dtypes: float64(1), int64(2), object(1)
memory usage: 192.0+ bytes

     city  exp_group  total_users    avg_age
0  Moscow          1         4414  27.325102
1  Moscow          3         4378  27.314299

In [2]:
df['total_users']

0    4414
1    4378
Name: total_users, dtype: int64